Repository: wp-plugins/hide-my-dates
Catalog: lang/hide-*-dates-*.po
Languages: ru_ru

source: Options saved.
ru_ru: Настройки сохранены.

source: Hide My Dates Settings
ru_ru: Настройки Hide My Dates

source: Do you use it ?
ru_ru: Вам нравится плагин ?

source: buy me a coffee
ru_ru: Купить мне чашку кофе :)

source: Hi! I'm <strong>Flector</strong>, developer of this plugin.
ru_ru: Привет, меня зовут Flector.

source: I've been spending many hours to develop this plugin.
ru_ru: Я потратил много времени на разработку этого плагина.

source: If you like and use this plugin, you can <strong>buy me a cup of coffee</strong>.
ru_ru: Поэтому я не откажусь от небольшого пожертвования :)

source: Donate with PayPal
ru_ru: Пожертвовать через PayPal

source: Options
ru_ru: Опции

source: Hide date
ru_ru: Скрыть дату

source: Post creation date (the_date or the_time) will be hidden from Google.
ru_ru: Дата создания записи (the_date или the_time) будет скрыта от Google.

source: Hide modified date
ru_ru: Скрыть дату изменения

source: The last modification date (the_modified_date or the_modified_time) will be hidden from Google.
ru_ru: Дата последнего изменения записи (the_modified_date или the_modified_time) будет скрыта от Google.

source: Hide dates of comments
ru_ru: Скрыть даты комментариев

source: Comment creation dates will be hidden from Google.
ru_ru: Даты создания комментариев будут скрыты от Google.

source: Update options &raquo;
ru_ru: Сохранить настройки &raquo;

source: Help
ru_ru: Помощь

source: How it works:
ru_ru: Как это работает:

source: The plugin uses a CSS hack to show the date – your visitors see it, but Google takes it <br />for the “title” parameter of a “span” element and does not consider it to be a part of <br />the page content. Therefore, the publishing date is not shown in the search snippet.
ru_ru: Плагин использует css-хак с выводом даты - ваши посетители видят дату, а Google<br /> воспринимает ее как title атрибут у span элемента и поэтому не считает ее частью<br /> контента страницы.

source: This hack will not work if dates in your theme are not shown directly through native <br />WordPress date functions – for instance, as in Twenty Eleven, Twenty Twelve <br />and later themes. Date hiding will <strong>not work</strong> in these themes!
ru_ru: Этот хак не будет работать, если дата в вашей теме выводится не напрямую через<br /> функции вывода дат. Как, например, в темах Twenty Eleven, Twenty Twelve и более<br /> поздних. Скрытие дат в таких темах <strong>не поддерживается</strong>!

source: Some themes only show the date of the last post modification. Hide it from Google <br />if you don’t want it to appear in the search snippet.
ru_ru: В некоторых темах используется вывод даты последнего изменения записи. Скройте<br /> ее от Google, если не хотите, чтобы дата вообще присутствовала в поисковом сниппете.

source: If Google doesn’t find the date in a post, it will take it from the first comment on the <br />page, so hiding comment creation dates is also a good idea.
ru_ru: Если Google не найдет дату в самой записи, то он возьмет ее из первого комментария<br /> на странице. Так что спрятать дату комментариев будет тоже хорошей идеей.

source: I hope you will find this plugin useful.
ru_ru: Надеюсь, что плагин будет для вас полезен.
